softrider70/lora/sdkconfig.defaults
# Heltec WiFi LoRa 32 V3 (ESP32-S3 + SX1262 + OLED SSD1306)

CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3 Dual-Core
CONFIG_FREERTOS_UNICORE=n

# PSRAM deaktiviert waehrend Debug (fehlerhaftes Octal-Tuning auf rev 0.2)
# CONFIG_SPIRAM is not set
# CONFIG_SPIRAM_MODE_OCT is not set
# CONFIG_SPIRAM_IGNORE_NOTFOUND is not set

# CPU Takt
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: 8MB Quad-Flash (Heltec V3 hat 8MB Embedded)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Eigene Partitionstabelle (OTA-Layout)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console: UART (fuer Monitor auf COM3)
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# ALLE Watchdogs deaktivieren
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT=n
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_INT_WDT_INIT=n
CONFIG_ESP_WDT_INIT=n

# FreeRTOS
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
CONFIG_ESP_IPC_TASK_STACK_SIZE=2048

# Enable HTTP server (fuer OTA-WebUI)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# OTA
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=4

# LWIP
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# mDNS
CONFIG_MDNS_ENABLE_NETWORKING=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# Compiler Optimization
CONFIG_COMPILER_OPTIMIZATION_NONE=y